Revit 2026 API

# AdvancedOpaqueOpaqueAlbedo Property

---

The property labeled "Color" from the "AdvancedOpaque" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string OpaqueAlbedo { get; }
```
```vb
Public Shared ReadOnly Property OpaqueAlbedo As String
	Get
```
```cpp
public:
static property String^ OpaqueAlbedo {
	String^ get ();
}
```
```fsharp
static member OpaqueAlbedo : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.

#### Reference

AdvancedOpaque Class

Autodesk.Revit.DB.Visual Namespace